# StairsAttrMonolithicStairs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsAttrMonolithicStairs Property
ParameterTypeId Class See Also
---
"Monolithic Stairs"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsAttrMonolithicStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAttrMonolithicStairs As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsAttrMonolithicStairs {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace